ko/bash.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ko" xml:lang="ko">
<head>
<title>bash</title>
<!-- 2018-02-25 Sun 05:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dongsoo Lee" />
<meta name="google-site-verification" content="T-NdGYU-tk3BMWg0ULx4wIHD18IFoyrzEEcOoyz4xis" />
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/emphasis.css"/>
<link rel="stylesheet" type="text/css" href="/dist/assets/css.css"/>
<link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet" integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN" crossorigin="anonymous">
<meta name="title" content="bash - 리눅스 명령어">
<meta name="description" content="">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="bash - 리눅스 명령어">
<meta property="og:description" content="">
<meta name="twitter:title" content="bash - 리눅스 명령어">
<meta name="twitter:description" content="">
</head>
<body>
<div id="content">
<h1 class="title">bash</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#overview">개요</a>
<ul>
<li><a href="#sec-1-1">예약 변수</a></li>
<li><a href="#sec-1-2">다른 쉘과 비교</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-overview" class="outline-2">
<h2 id="overview"><a id="sec-1" name="sec-1"></a>개요</h2>
<div class="outline-text-2" id="text-overview">
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">예약 변수</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><span class="org-programming-variable">HOME</span>:
사용자의 홈 디렉토리                                       
</li>
<li><span class="org-programming-variable">PATH</span>:
실행 파일을 찾을 경로                                      
</li>
<li><span class="org-programming-variable">LANG</span>:
프로그램 사용시 기본 지원되는 언어                         
</li>
<li><span class="org-programming-variable">PWD</span>:
사용자의 현재 작업중인 디렉토리                            
</li>
<li><span class="org-programming-variable">FUNCNAME</span>:
현재 함수 이름                                             
</li>
<li><span class="org-programming-variable">SECONDS</span>:
스크립트가 실행된 초 단위 시간                             
</li>
<li><span class="org-programming-variable">SHLVL</span>:
쉘 레벨(중첩된 깊이를 나타냄)                              
</li>
<li><span class="org-programming-variable">SHELL</span>:
로그인해서 사용하는 쉘                                     
</li>
<li><span class="org-programming-variable">PPID</span>:
부모 프로세스의 PID                                        
</li>
<li><span class="org-programming-variable">BASH</span>:
BASH 실행 파일 경로                                        
</li>
<li><span class="org-programming-variable">BASH_ENV</span>:
스크립트 실행시 BASH 시작 파일을 읽을 위치 변수            
</li>
<li><span class="org-programming-variable">BASH_VERSION</span>:
설치된 BASH 버전                                           
</li>
<li><span class="org-programming-variable">BASH_VERSINFO</span>:
BASH_VERSINFO[0 ] ~ BASH_VERSINFO[5 ]배열로 상세정보 제공  
</li>
<li><span class="org-programming-variable">MAIL</span>:
메일 보관 경로                                             
</li>
<li><span class="org-programming-variable">MAILCHECK</span>:
메일 확인 시간                                             
</li>
<li><span class="org-programming-variable">OSTYPE</span>:
운영체제 종류                                              
</li>
<li><span class="org-programming-variable">TERM</span>:
로긴 터미널 타입                                           
</li>
<li><span class="org-programming-variable">HOSTNAME</span>:
호스트 이름                                                
</li>
<li><span class="org-programming-variable">HOSTTYPE</span>:
시스템 하드웨어 종류                                       
</li>
<li><span class="org-programming-variable">MACHTYPE</span>:
머신 종류(HOSTTYPE과 같은 정보지만 조금더 상세하게 표시됨) 
</li>
<li><span class="org-programming-variable">LOGNAME</span>:
로그인 이름                                                
</li>
<li><span class="org-programming-variable">UID</span>:
사용자 UID                                                 
</li>
<li><span class="org-programming-variable">EUID</span>:
su 명령에서 사용하는 사용자의 유효 아이디 값(UID와 EUID 값은 다를 수 있음) 
</li>
<li><span class="org-programming-variable">USER</span>:
사용자의 이름                                              
</li>
<li><span class="org-programming-variable">USERNAME</span>:
사용자 이름                                                
</li>
<li><span class="org-programming-variable">GROUPS</span>:
사용자 그룹(/etc/passwd 값을 출력)                         
</li>
<li><span class="org-programming-variable">HISTFILE</span>:
history 파일 경로                                          
</li>
<li><span class="org-programming-variable">HISTFILESIZE</span>:
history 파일 크기                                          
</li>
<li><span class="org-programming-variable">HISTSIZE</span>:
history 저장되는 개수                                      
</li>
<li><span class="org-programming-variable">HISTCONTROL</span>:
중복되는 명령에 대한 기록 유무                             
</li>
<li><span class="org-programming-variable">DISPLAY</span>:
X 디스플레이 이름                                          
</li>
<li><span class="org-programming-variable">IFS</span>:
입력 필드 구분자(기본값:   - 빈칸)                         
</li>
<li><span class="org-programming-variable">VISUAL</span>:
VISUAL 편집기 이름                                         
</li>
<li><span class="org-programming-variable">EDITOR</span>:
기본 편집기 이름                                           
</li>
<li><span class="org-programming-variable">COLUMNS</span>:
현재 터미널이나 윈도우 터미널의 컬럼 수                    
</li>
<li><span class="org-programming-variable">LINES</span>:
터미널의 라인 수                                           
</li>
<li><span class="org-programming-variable">LS_COLORS</span>:
ls 명령의 색상 관련 옵션                                   
</li>
<li><span class="org-programming-variable">PS1</span>:
기본 프롬프트 변수(기본값: bash\$)                         
</li>
<li><span class="org-programming-variable">PS2</span>:
보조 프롬프트 변수(기본값: &gt;), 명령을 "\"를 사용하여 명령 행을 연장시 사용됨 
</li>
<li><span class="org-programming-variable">PS3</span>:
쉘 스크립트에서 select 사용시 프롬프트 변수(기본값: #?)    
</li>
<li><span class="org-programming-variable">PS4</span>:
쉘 스크립트 디버깅 모드의 프롬프트 변수(기본값: +)         
</li>
<li><span class="org-programming-variable">TMOUT</span>:
0이면 제한이 없으며 time시간 지정시 지정한 시간 이후 로그아웃 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">다른 쉘과 비교</h3>
<div class="outline-text-3" id="text-1-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">sh</th>
<th scope="col" class="left">csh</th>
<th scope="col" class="left">ksh</th>
<th scope="col" class="left">bash</th>
<th scope="col" class="left">tcsh</th>
<th scope="col" class="left">zsh</th>
<th scope="col" class="left">rc</th>
<th scope="col" class="left">es</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Job control</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Aliases</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Shell functions</td>
<td class="left">Y(1)</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
</tr>

<tr>
<td class="left">"Sensible" Input/Output redirection</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
</tr>

<tr>
<td class="left">Directory stack</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">F</td>
<td class="left">F</td>
</tr>

<tr>
<td class="left">Command history</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">L</td>
<td class="left">L</td>
</tr>

<tr>
<td class="left">Command line editing</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">L</td>
<td class="left">L</td>
</tr>

<tr>
<td class="left">Vi Command line editing</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y(3)</td>
<td class="left">Y</td>
<td class="left">L</td>
<td class="left">L</td>
</tr>

<tr>
<td class="left">Emacs Command line editing</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">L</td>
<td class="left">L</td>
</tr>

<tr>
<td class="left">Rebindable Command line editing</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">L</td>
<td class="left">L</td>
</tr>

<tr>
<td class="left">User name look up</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">L</td>
<td class="left">L</td>
</tr>

<tr>
<td class="left">Login/Logout watching</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">F</td>
<td class="left">F</td>
</tr>

<tr>
<td class="left">Filename completion</td>
<td class="left">&#xa0;</td>
<td class="left">Y(1)</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">L</td>
<td class="left">L</td>
</tr>

<tr>
<td class="left">Username completion</td>
<td class="left">&#xa0;</td>
<td class="left">Y(2)</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">L</td>
<td class="left">L</td>
</tr>

<tr>
<td class="left">Hostname completion</td>
<td class="left">&#xa0;</td>
<td class="left">Y(2)</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">L</td>
<td class="left">L</td>
</tr>

<tr>
<td class="left">History completion</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">L</td>
<td class="left">L</td>
</tr>

<tr>
<td class="left">Fully programmable Completion</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Mh Mailbox completion</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">(4)</td>
<td class="left">(6)</td>
<td class="left">(6)</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Co Processes</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Builtin artithmetic evaluation</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Can follow symbolic links invisibly</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Periodic command execution</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Custom Prompt (easily)</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
</tr>

<tr>
<td class="left">Sun Keyboard Hack</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Spelling Correction</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Process Substitution</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y(2)</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Underlying Syntax</td>
<td class="left">sh</td>
<td class="left">csh</td>
<td class="left">sh</td>
<td class="left">sh</td>
<td class="left">csh  sh</td>
<td class="left">rc</td>
<td class="left">rc</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Freely Available</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">(5)  Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Checks Mailbox</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">F</td>
<td class="left">F</td>
</tr>

<tr>
<td class="left">Tty Sanity Checking</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Can cope with large argument lists</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
</tr>

<tr>
<td class="left">Has non-interactive startup file</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y(7)  Y(7)  Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Has non-login startup file</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y(7)  Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Can avoid user startup files</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
</tr>

<tr>
<td class="left">Can specify startup file</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Low level command redefinition</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
</tr>

<tr>
<td class="left">Has anonymous functions</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
</tr>

<tr>
<td class="left">List Variables</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
</tr>

<tr>
<td class="left">Full signal trap handling</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
</tr>

<tr>
<td class="left">File no clobber ability</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">F</td>
</tr>

<tr>
<td class="left">Local variables</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
<td class="left">Y</td>
<td class="left">Y</td>
</tr>

<tr>
<td class="left">Lexically scoped variables</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
</tr>

<tr>
<td class="left">Exceptions</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">Y</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-20</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-02-25 Sun 05:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
